app/Controllers/Home.php

    public function wizard(){
        if (!session('logged_in'))
        {
            return redirect()->to(site_url());
        }
        if($this->request->getPost()){
            $data_post = $this->request->getPost();

            $country = $data_post['country'] ?? null;
            $data_post['country'] = $country ?? $data_post['country_hidden'];

            $weekly_working_hours = $data_post['weekly_working_hours'] ?? null;
            $weekly_working_hours = $weekly_working_hours ?? $data_post['weekly_working_hours_hidden'];
            $data_post['weekly_working_hours'] = str_replace(',', '.', $weekly_working_hours);

            $monthly_salary = $data_post['monthly_salary'];
            $data_post['monthly_salary'] = str_replace(',', '.', $monthly_salary);

            if($this->EmployeesModel->save($data_post))
            {
                $email_body = $this->emailBody($data_post);
                $this->sendSingleMail('ariel.martinez@metodoconsolida.es', 'Nueva alta', $email_body, 'ariel.martinez@metodoconsolida.es', 'd.mondaca@metodoconsolida.es');
            }
            return redirect()->to(site_url().'process?token=394ffkgmtrl456gfktdmvkas');

        }
        $data['companies'] = $this->CompaniesModel->where('com_user_id', session('id'))->findAll();
        $data['countries'] = $this->CountriesModel->findAll();
        $data['road_types'] = $this->Road_typesModel->findAll();
        $data['provinces'] = $this->ProvincesModel->findAll();
---
INSERT INTO `employees` (`cif`, `name`, `lastname`, `birthdate`, `document_type`, `nif`, `number_ss`, `account`, `email`, `phone`, `gender`, `road_type`, `street_name`, `address_number`, `stairs`, `floor`, `door`, `zip`, `category`, `contract_type`, `contract_date_start`, `type_of_day`, `monthly_salary`, `salary_type`, `country`, `weekly_working_hours`, `created_at`, `updated_at`) VALUES ('B86024007', 'Ariel', 'Martinez', '1979-12-01', 'dni', 'xxx', 'aaaaaaaaaaaa', 'xx', 'papelo.amh@gmail.com', '666666666', 'hombre', 'Aldea', 'aaa', 'aaa', '', '', '', 'aaaaa', 'AUXILIAR LIMPIEZA', 'indefinido', '2023-02-27', 'completa', '1000', 'bruto', 'España', '40', '2023-02-27 10:26:44', '2023-02-27 10:26:44')
SELECT *
FROM `companies`
WHERE `com_user_id` = '1'
SELECT *
FROM `countries`
SELECT *
FROM `road_types`
SELECT *
FROM `provinces`

    public function check_login($login, $password, $setupSession = true)
    {
        if (empty($login) || empty($password)) {
            return ['result' => false, 'msg' => 'Usuario/Contraseña incorrectas', 'user' => null];
        }

        $user = $this->usersModel->where('username', $login) ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'mzg'
 LIMIT 1

    function get_select_work_centers(){
        $company_id = $this->request->getGet('company_id');
        if(empty($company_id)) die('');
        $company = $this->CompaniesModel->where('id', $company_id)->first();
        $work_centers = $this->Work_centersModel->where('wc_company_id', $company_id)->findAll();
---
SELECT *
FROM `companies`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `Work_centers`
WHERE `wc_company_id` = '1'

    function get_select_categories(){
        $company_id = $this->request->getGet('company_id');
        if(empty($company_id)) die('');
        $company = $this->CompaniesModel->where('id', $company_id)->first();
        $categories = $this->CategoriesModel->where(['cat_agreement_id' => $company->com_agreement_id, 'cat_user_id' => session('id')])->orderBy('cat_name', 'ASC')->findAll();
---
SELECT *
FROM `companies`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `categories`
WHERE `cat_agreement_id` = '1'
AND `cat_user_id` = '1'
ORDER BY `cat_name` ASC

    function get_select_work_places(){
        $category_id = $this->request->getGet('category_id');
        if(empty($category_id)) die('');
        $work_places = $this->Work_placesModel->where(['wp_category_id' => $category_id])->orderBy('wp_name', 'ASC')->findAll();
---
SELECT *
FROM `work_places`
WHERE `wp_category_id` = '11'
ORDER BY `wp_name` ASC

    function get_work_place_data(){
        $work_place_id_id = $this->request->getGet('work_place_id_id');
        if(empty($work_place_id_id)) die('');
        $work_place = $this->Work_placesModel->find($work_place_id_id);
---
SELECT *
FROM `Work_places`
WHERE `Work_places`.`id` = '39'