app/Controllers/Home.php

SELECT *
FROM `cnos_level_1`
SELECT *
FROM `education_levels`
---
        $data['countries'] = $this->CountriesModel->findAll();
        $data['road_types'] = $this->Road_typesModel->findAll();
        $data['provinces'] = $this->Provinces_Model->findAll();
        $data['cnos_level_1'] = $this->Cnos_level_1_Model->findAll();
        $data['education_levels'] = $this->Education_levels_Model->findAll();

SELECT *
FROM `categories`
WHERE `cat_agreement_id` = '1'
AND `cat_user_id` = '1'
ORDER BY `cat_name` ASC
---
    function get_select_categories(){
        $agreement_id = $this->request->getGet('agreement_id');
        if(empty($agreement_id)) die('');
        $categories = $this->CategoriesModel->where(['cat_agreement_id' => $agreement_id, 'cat_user_id' => session('id')])->orderBy('cat_name', 'ASC')->findAll();

SELECT *
FROM `municipalities`
WHERE `mun_province_id` = '2'
ORDER BY `mun_name` ASC
---
    function get_municipalities(){
        $province_id = $this->request->getGet('province_id');
        if(empty($province_id)) die('');
        $municipalities = $this->Municipalities_Model->where(['mun_province_id' => $province_id])->orderBy('mun_name', 'ASC')->findAll();

SELECT *
FROM `cnos_level_2`
WHERE `parent_id` = '2'
ORDER BY `cno_name` ASC
---
    function get_cnos_level_2(){
        $parent_id = $this->request->getGet('parent_id');
        if(empty($parent_id)) die('');
        $cnos = $this->Cnos_level_2_Model->where(['parent_id' => $parent_id])->orderBy('cno_name', 'ASC')->findAll();