app/Controllers/Home.php

    public function wizard(){
        if (!session('logged_in'))
        {
            return redirect()->to(site_url());
        }
        if($this->request->getPost()){
            $data_post = $this->request->getPost();

            $country = $data_post['country'] ?? null;
            $data_post['country'] = $country ?? $data_post['country_hidden'];

            $weekly_working_hours = $data_post['weekly_working_hours'] ?? null;
            $weekly_working_hours = $weekly_working_hours ?? $data_post['weekly_working_hours_hidden'];
            $data_post['weekly_working_hours'] = str_replace(',', '.', $weekly_working_hours);

            $monthly_salary = $data_post['monthly_salary'];
            $data_post['monthly_salary'] = str_replace(',', '.', $monthly_salary);

            $this->EmployeesModel->save($data_post);

            return redirect()->to(site_url().'process?token=394ffkgmtrl456gfktdmvkas');

        }
        $data['companies'] = $this->CompaniesModel->where('com_user_id', session('id'))->findAll();
        $data['countries'] = $this->CountriesModel->findAll();
        $data['road_types'] = $this->Road_typesModel->findAll();
        $data['categories'] = $this->CategoriesModel->findAll();
---
SELECT *
FROM `companies`
WHERE `com_user_id` = '1'
SELECT *
FROM `countries`
SELECT *
FROM `road_types`
SELECT *
FROM `categories`

    public function check_login($login, $password, $setupSession = true)
    {
        if (empty($login) || empty($password)) {
            return ['result' => false, 'msg' => 'Usuario/Contraseña incorrectas', 'user' => null];
        }

        $user = $this->usersModel->where('username', $login) ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'lamucca'
 LIMIT 1